<a href="https://colab.research.google.com/github/HwangHanJae/datascience-basic-tect/blob/main/pandas_10minutes_tutorial.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Pandas Tutorial
- 10 minutes to pandas

# 라이브러리 로드

In [1]:
import numpy as np
import pandas as pd

# 객체 생성

value의 리스트를 전달하여 Series 타입을 생성하고 pandas의 기본 인덱스를 적용합니다.

In [2]:
#Input
s = pd.Series([1,3,5, np.nan, 6,8])
#Output
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

datatime 타입과 레이블이있는 column과 Numpy array를 전달하여 Dataframe을 생성합니다.

In [3]:
dates = pd.date_range("20130101", periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [4]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list("ABCD"))
df

                   A         B         C         D
2013-01-01 -0.719673 -0.196648  1.465144  1.424438
2013-01-02  1.365767  0.154625  1.076519 -1.402865
2013-01-03 -0.094029 -0.191505  0.332718 -0.002612
2013-01-04  1.189502  0.323903 -0.282809  0.793369
2013-01-05 -0.335897 -0.404370  0.987365  3.317728
2013-01-06  0.245165 -0.769041 -0.580168 -2.713720

Series 타입처럼 변환할수 있는 객체의 dict 타입을 전달하여 DataFrame을 생성합니다.

In [5]:
df2 = pd.DataFrame(
    {"A" : 1.0,
    "B" : pd.Timestamp("20130102"),
    "C" : pd.Series(1, index=list(range(4)), dtype="float32"),
    "D" : np.array([3] *4, dtype="int32"),
    "E" : pd.Categorical(["test","train","test","train"]),
    "F" : 'foo',}
)

df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

Dataframe의 columns 들은 다른 dtypes를 가지고 있습니다.

In [6]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

# 데이터 관찰

데이터 프레임의 상단, 하단을 보는 방법입니다.

In [7]:
df.head()

                   A         B         C         D
2013-01-01 -0.719673 -0.196648  1.465144  1.424438
2013-01-02  1.365767  0.154625  1.076519 -1.402865
2013-01-03 -0.094029 -0.191505  0.332718 -0.002612
2013-01-04  1.189502  0.323903 -0.282809  0.793369
2013-01-05 -0.335897 -0.404370  0.987365  3.317728

In [8]:
df.tail()

                   A         B         C         D
2013-01-02  1.365767  0.154625  1.076519 -1.402865
2013-01-03 -0.094029 -0.191505  0.332718 -0.002612
2013-01-04  1.189502  0.323903 -0.282809  0.793369
2013-01-05 -0.335897 -0.404370  0.987365  3.317728
2013-01-06  0.245165 -0.769041 -0.580168 -2.713720

index, columns를 표현합니다.

In [9]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [10]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

DataFrame.to_numpy()는 NumPy 표현을 제공합니다.

In [11]:
df

                   A         B         C         D
2013-01-01 -0.719673 -0.196648  1.465144  1.424438
2013-01-02  1.365767  0.154625  1.076519 -1.402865
2013-01-03 -0.094029 -0.191505  0.332718 -0.002612
2013-01-04  1.189502  0.323903 -0.282809  0.793369
2013-01-05 -0.335897 -0.404370  0.987365  3.317728
2013-01-06  0.245165 -0.769041 -0.580168 -2.713720

In [12]:
df.to_numpy()

array([[-7.19673223e-01, -1.96648044e-01,  1.46514443e+00,
         1.42443826e+00],
       [ 1.36576711e+00,  1.54625339e-01,  1.07651883e+00,
        -1.40286547e+00],
       [-9.40292586e-02, -1.91505045e-01,  3.32717757e-01,
        -2.61164187e-03],
       [ 1.18950166e+00,  3.23903073e-01, -2.82808973e-01,
         7.93369459e-01],
       [-3.35897439e-01, -4.04370414e-01,  9.87365029e-01,
         3.31772841e+00],
       [ 2.45165259e-01, -7.69041143e-01, -5.80168474e-01,
        -2.71371998e+00]])

In [13]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [14]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

DataFrame.to_numpy()는 index와 columns를 포함하지 않습니다.

Data를 T(transpose)합니다.

In [15]:
df

                   A         B         C         D
2013-01-01 -0.719673 -0.196648  1.465144  1.424438
2013-01-02  1.365767  0.154625  1.076519 -1.402865
2013-01-03 -0.094029 -0.191505  0.332718 -0.002612
2013-01-04  1.189502  0.323903 -0.282809  0.793369
2013-01-05 -0.335897 -0.404370  0.987365  3.317728
2013-01-06  0.245165 -0.769041 -0.580168 -2.713720

In [16]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.719673    1.365767   -0.094029    1.189502   -0.335897    0.245165
B   -0.196648    0.154625   -0.191505    0.323903   -0.404370   -0.769041
C    1.465144    1.076519    0.332718   -0.282809    0.987365   -0.580168
D    1.424438   -1.402865   -0.002612    0.793369    3.317728   -2.713720

axis=1(열)을 기준으로 정렬합니다.

In [17]:
df

                   A         B         C         D
2013-01-01 -0.719673 -0.196648  1.465144  1.424438
2013-01-02  1.365767  0.154625  1.076519 -1.402865
2013-01-03 -0.094029 -0.191505  0.332718 -0.002612
2013-01-04  1.189502  0.323903 -0.282809  0.793369
2013-01-05 -0.335897 -0.404370  0.987365  3.317728
2013-01-06  0.245165 -0.769041 -0.580168 -2.713720

In [18]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  1.424438  1.465144 -0.196648 -0.719673
2013-01-02 -1.402865  1.076519  0.154625  1.365767
2013-01-03 -0.002612  0.332718 -0.191505 -0.094029
2013-01-04  0.793369 -0.282809  0.323903  1.189502
2013-01-05  3.317728  0.987365 -0.404370 -0.335897
2013-01-06 -2.713720 -0.580168 -0.769041  0.245165

values를 기준으로 정렬합니다.

기본적으로 오름차순이 적용됩니다. ascending = True

In [19]:
df.sort_values(by="B")

                   A         B         C         D
2013-01-06  0.245165 -0.769041 -0.580168 -2.713720
2013-01-05 -0.335897 -0.404370  0.987365  3.317728
2013-01-01 -0.719673 -0.196648  1.465144  1.424438
2013-01-03 -0.094029 -0.191505  0.332718 -0.002612
2013-01-02  1.365767  0.154625  1.076519 -1.402865
2013-01-04  1.189502  0.323903 -0.282809  0.793369

# 가져오기

single column을 선택하면 Series 가 생성이 됩니다.

df.A와 기능이 동등합니다.

In [20]:
df["A"]

2013-01-01   -0.719673
2013-01-02    1.365767
2013-01-03   -0.094029
2013-01-04    1.189502
2013-01-05   -0.335897
2013-01-06    0.245165
Freq: D, Name: A, dtype: float64

[]을 사용하면 행을 분할(슬라이싱) 합니다.

In [21]:
df[0:3]

                   A         B         C         D
2013-01-01 -0.719673 -0.196648  1.465144  1.424438
2013-01-02  1.365767  0.154625  1.076519 -1.402865
2013-01-03 -0.094029 -0.191505  0.332718 -0.002612

In [22]:
df["20130102":"20130104"]

                   A         B         C         D
2013-01-02  1.365767  0.154625  1.076519 -1.402865
2013-01-03 -0.094029 -0.191505  0.332718 -0.002612
2013-01-04  1.189502  0.323903 -0.282809  0.793369

# 레이블별 선택

레이블을 사용하여 가져오기

In [23]:
df.loc[dates[0]]

A   -0.719673
B   -0.196648
C    1.465144
D    1.424438
Name: 2013-01-01 00:00:00, dtype: float64

컬럼을 다중으로 선택하여 가져오기

In [24]:
df.loc[:, ["A", "B"]]

                   A         B
2013-01-01 -0.719673 -0.196648
2013-01-02  1.365767  0.154625
2013-01-03 -0.094029 -0.191505
2013-01-04  1.189502  0.323903
2013-01-05 -0.335897 -0.404370
2013-01-06  0.245165 -0.769041

종료지점을 포함한 슬라이싱

In [25]:
df.loc["20130102" : "20130104", ["A","B"]]

                   A         B
2013-01-02  1.365767  0.154625
2013-01-03 -0.094029 -0.191505
2013-01-04  1.189502  0.323903

객체가 반환하는 차원이 감소합니다.

In [26]:
df.loc["20130102", ["A","B"]]

A    1.365767
B    0.154625
Name: 2013-01-02 00:00:00, dtype: float64

scalar 값을 가져옵니다

In [27]:
df.loc[dates[0], "A"]

-0.7196732232309373

scalar에 빠르게 엑세스하여 가져오는 방법입니다.

In [28]:
# df.at["20130101","A"]
df.at[dates[0],"A"]

-0.7196732232309373

# 위치(position)별로 선택

전달된 정수(integers)의 위치를 통해 다음을 선택

In [29]:
df.iloc[3]

A    1.189502
B    0.323903
C   -0.282809
D    0.793369
Name: 2013-01-04 00:00:00, dtype: float64

슬라이싱을 통해 Numpy/Python과 유사하게 작동합니다.

In [30]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04  1.189502  0.323903
2013-01-05 -0.335897 -0.404370

정수 리스트를 통해 표현

In [31]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02  1.365767  1.076519
2013-01-03 -0.094029  0.332718
2013-01-05 -0.335897  0.987365

row(행)만 슬라이싱을 합니다.

In [32]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02  1.365767  0.154625  1.076519 -1.402865
2013-01-03 -0.094029 -0.191505  0.332718 -0.002612

columns(열)만 슬라이싱 합니다.

In [33]:
df.iloc[:, 1:3]

                   B         C
2013-01-01 -0.196648  1.465144
2013-01-02  0.154625  1.076519
2013-01-03 -0.191505  0.332718
2013-01-04  0.323903 -0.282809
2013-01-05 -0.404370  0.987365
2013-01-06 -0.769041 -0.580168

value(값)로 가져옵니다.

In [34]:
df.iloc[1,1]

0.1546253388969073

scalar를 빠르게 엑세스하여 가져옵니다.

In [35]:
df.iat[1,1]

0.1546253388969073

#Boolean indexing

single column의 value를 통해 선택합니다.

In [36]:
df[df["A"]>0]

                   A         B         C         D
2013-01-02  1.365767  0.154625  1.076519 -1.402865
2013-01-04  1.189502  0.323903 -0.282809  0.793369
2013-01-06  0.245165 -0.769041 -0.580168 -2.713720

In [37]:
df

                   A         B         C         D
2013-01-01 -0.719673 -0.196648  1.465144  1.424438
2013-01-02  1.365767  0.154625  1.076519 -1.402865
2013-01-03 -0.094029 -0.191505  0.332718 -0.002612
2013-01-04  1.189502  0.323903 -0.282809  0.793369
2013-01-05 -0.335897 -0.404370  0.987365  3.317728
2013-01-06  0.245165 -0.769041 -0.580168 -2.713720

In [38]:
df[df>0]

                   A         B         C         D
2013-01-01       NaN       NaN  1.465144  1.424438
2013-01-02  1.365767  0.154625  1.076519       NaN
2013-01-03       NaN       NaN  0.332718       NaN
2013-01-04  1.189502  0.323903       NaN  0.793369
2013-01-05       NaN       NaN  0.987365  3.317728
2013-01-06  0.245165       NaN       NaN       NaN

isin() method를 통해 필터링

In [39]:
df2 = df.copy()
df2['E'] = ["one","one","two","three","four","three"]
df2

                   A         B         C         D      E
2013-01-01 -0.719673 -0.196648  1.465144  1.424438    one
2013-01-02  1.365767  0.154625  1.076519 -1.402865    one
2013-01-03 -0.094029 -0.191505  0.332718 -0.002612    two
2013-01-04  1.189502  0.323903 -0.282809  0.793369  three
2013-01-05 -0.335897 -0.404370  0.987365  3.317728   four
2013-01-06  0.245165 -0.769041 -0.580168 -2.713720  three

In [40]:
df2[df2['E'].isin(["two","four"])]

                   A         B         C         D     E
2013-01-03 -0.094029 -0.191505  0.332718 -0.002612   two
2013-01-05 -0.335897 -0.404370  0.987365  3.317728  four

# Setting

새로운 column을 설정하면 index별로 데이터가 자동으로 정렬됩니다.

In [42]:
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range("20130102", periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [43]:
df['F'] = s1

In [44]:
df

                   A         B         C         D    F
2013-01-01 -0.719673 -0.196648  1.465144  1.424438  NaN
2013-01-02  1.365767  0.154625  1.076519 -1.402865  1.0
2013-01-03 -0.094029 -0.191505  0.332718 -0.002612  2.0
2013-01-04  1.189502  0.323903 -0.282809  0.793369  3.0
2013-01-05 -0.335897 -0.404370  0.987365  3.317728  4.0
2013-01-06  0.245165 -0.769041 -0.580168 -2.713720  5.0

label 별로 value를 설정합니다.

In [49]:
df.at[dates[0], "A"] = 0
df

                   A         B         C         D    F
2013-01-01  0.000000 -0.196648  1.465144  1.424438  NaN
2013-01-02  1.365767  0.154625  1.076519 -1.402865  1.0
2013-01-03 -0.094029 -0.191505  0.332718 -0.002612  2.0
2013-01-04  1.189502  0.323903 -0.282809  0.793369  3.0
2013-01-05 -0.335897 -0.404370  0.987365  3.317728  4.0
2013-01-06  0.245165 -0.769041 -0.580168 -2.713720  5.0

position 별로 value를 설정합니다.

In [50]:
df.iat[0,1] = 0
df

                   A         B         C         D    F
2013-01-01  0.000000  0.000000  1.465144  1.424438  NaN
2013-01-02  1.365767  0.154625  1.076519 -1.402865  1.0
2013-01-03 -0.094029 -0.191505  0.332718 -0.002612  2.0
2013-01-04  1.189502  0.323903 -0.282809  0.793369  3.0
2013-01-05 -0.335897 -0.404370  0.987365  3.317728  4.0
2013-01-06  0.245165 -0.769041 -0.580168 -2.713720  5.0

NumPy array를 할당하여 설정합니다.

In [52]:
df.loc[:,"D"] = np.array([5] * len(df))
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000  1.465144  5  NaN
2013-01-02  1.365767  0.154625  1.076519  5  1.0
2013-01-03 -0.094029 -0.191505  0.332718  5  2.0
2013-01-04  1.189502  0.323903 -0.282809  5  3.0
2013-01-05 -0.335897 -0.404370  0.987365  5  4.0
2013-01-06  0.245165 -0.769041 -0.580168  5  5.0

In [53]:
df2 = df.copy()
df2[df2 > 0] = -df2
df2

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -1.465144 -5  NaN
2013-01-02 -1.365767 -0.154625 -1.076519 -5 -1.0
2013-01-03 -0.094029 -0.191505 -0.332718 -5 -2.0
2013-01-04 -1.189502 -0.323903 -0.282809 -5 -3.0
2013-01-05 -0.335897 -0.404370 -0.987365 -5 -4.0
2013-01-06 -0.245165 -0.769041 -0.580168 -5 -5.0